2Eva/CodeIgniter/app/Models/NewsModel.php

SELECT *
FROM `news`
SELECT `news`.*, `categories`.`category`
FROM `news`
JOIN `categories` ON `news`.`id_category`=`categories`.`id`
WHERE `slug` = 0
---
    public function getNews($slug = false)
    {
        if ($slug === false) {
            $sql = $this->select('news.*,category.category');
            $sql = $this->join('category', 'news.id_category=category.id');
            return $this->findAll();
        }

        $sql = $this->select('news.*,category.category');
        $sql = $this->join('category', 'news.id_category=category.id');
        $sql = $this->where(['slug' => $slug]);
        $sql = $this->first();