2Eva/CodeIgniter/app/Models/UserModel.php

    public function checkUser($user, $pass)
    {
        return $this->where(['username' => $user, 'password' => $pass])->find();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `password` = '1234'