gym/app/Models/EjercicioModel.php

SELECT `ejercicios`.*, `grupos_musculares`.`nombre` as `grupo_nombre`
FROM `ejercicios`
JOIN `grupos_musculares` ON `ejercicios`.`id_grupo` = `grupos_musculares`.`id`
WHERE `ejercicios`.`destacado` = 1
 LIMIT 3
---
    public function getDestacados()
    {
        return $this->select('ejercicios.*, grupos_musculares.nombre as grupo_nombre')
                    ->join('grupos_musculares', 'ejercicios.id_grupo = grupos_musculares.id')
                    ->where('ejercicios.destacado', 1)
                    ->findAll(3);