2Eva/Codeigniter-ultimo/app/Models/CancionesModel.php

SELECT `canciones`.`id`, `canciones`.`nombre` as `cancion_nombre`, `canciones`.`id_cantante`, `cantantes`.`nombre` as `cantante_nombre`
FROM `canciones`
JOIN `cantantes` ON `canciones`.`id_cantante` = `cantantes`.`id`
---
    public function getCanciones($id = false)
    {
        $builder = $this->select('canciones.id, canciones.nombre as cancion_nombre, canciones.id_cantante, cantantes.nombre as cantante_nombre')
                        ->join('cantantes', 'canciones.id_cantante = cantantes.id');

        if ($id === false) {
            return $builder->findAll();