2Eva/CodeigniterPolRep/app/Controllers/Artistas.php

SELECT *
FROM `artistas`
---
    public function index()
    {
        $model = model(ArtistasModel::class);

        $data = [
            'artistas_list' => $model->findAll(),
            'title'         => 'Artistas Management',
        ];