gym/app/Controllers/admin.php

    public function index()
    {
        $data = [
            'total_ejercicios' => model(EjercicioModel::class)->countAllResults(),
            'total_grupos'     => model(GrupoModel::class)->countAllResults(),
            'total_noticias'   => model(NoticiaModel::class)->countAllResults(),
            'total_usuarios'   => model(UserModel::class)->countAllResults(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `ejercicios`
SELECT COUNT(*) AS `numrows`
FROM `noticias`
SELECT COUNT(*) AS `numrows`
FROM `users`