gym/app/Controllers/Ejercicios.php

    public function autocomplete()
    {
        $request = service('request');
        $postData = $request->getPost();

        $response = array();
        $data = array();

        $response['token'] = csrf_hash();

        if (isset($postData['search'])) {
            $search = $postData['search'];
            $model = new \App\Models\EjercicioModel();

            $listaEjercicios = $model->select('id, titulo')
                                     ->like('titulo', $search)
                                     ->orderBy('titulo', 'ASC')
                                     ->findAll(10);
---
SELECT `id`, `titulo`
FROM `ejercicios`
WHERE `titulo` LIKE '%z%' ESCAPE '!'
ORDER BY `titulo` ASC
 LIMIT 10