gym/app/Controllers/Home.php

SELECT *
FROM `noticias`
ORDER BY `fecha_publicacion` DESC
 LIMIT 3
---
    public function index()
    {
        $ejercicioModel = new EjercicioModel();
        $noticiaModel   = new NoticiaModel();
        $grupoModel     = new GrupoModel();

        $data = [
            'destacados' => $ejercicioModel->getDestacados(),

            'noticias'   => $noticiaModel->orderBy('fecha_publicacion', 'DESC')->findAll(3),