gym/app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function checkUser()
    {
        if (! $this->validate([
            'username' => 'required',
            'password' => 'required'
        ])) {
            return redirect()->back()->withInput()->with('error', 'Faltan datos');
        }

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $model = new UserModel();

        $user = $model->where('username', $username)->first();