disney copy/app/Models/PersonajeModel.php

SELECT `personajes`.`id`, `personajes`.`nombre` as `personaje_nombre`, `personajes`.`id_pelicula`, `peliculas`.`titulo` as `pelicula_nombre`
FROM `personajes`
JOIN `peliculas` ON `personajes`.`id_pelicula` = `peliculas`.`id`
SELECT `personajes`.`id`, `personajes`.`nombre` as `personaje_nombre`, `personajes`.`id_pelicula`, `peliculas`.`titulo` as `pelicula_nombre`
FROM `personajes`
JOIN `peliculas` ON `personajes`.`id_pelicula` = `peliculas`.`id`
WHERE `personajes`.`id` = 1
 LIMIT 1
---
    public function getPersonajes($id = false)
    {
        $builder = $this->select('personajes.id, personajes.nombre as personaje_nombre, personajes.id_pelicula, peliculas.titulo as pelicula_nombre') ->join('peliculas', 'personajes.id_pelicula = peliculas.id');

        if ($id === false) {
            return $builder->findAll();
        }

        return $builder->where('personajes.id', $id)->first();