2Eva/CodeIgniter/app/Controllers/News.php

    public function update($id)
    {
        helper('form');

        if($id == null) {
            throw new PageNotFoundException('Cannot update the news item');
        }

        $model = model(NewsModel::class);
        $model_cat = model(CategoryModel::class);

        if($model->where('id', $id)->find()){
            $data = [
                'news' => $model->where('id',$id)->first(),
                'title' => 'Update item',
                'category' => $model_cat->findAll(),
            ];
---
SELECT *
FROM `news`
WHERE `id` = '1'
SELECT *
FROM `news`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `categories`

    public function updatedItem($id)
    {
        helper('form');

        if(! $this->validate([
            'title' => 'required|max_length[255]|min_length[3]',
            'body' => 'required|max_length[5000]|min_length[10]',
            'id_category'  => 'required',
        ])) {
            return $this->update($id);
        }

        $post = $this->validator->getValidated();

        $data = [
            'id' => $id,
            'title' => $post['title'],
            'slug' => url_title($post['title'], '-', true),
            'body' => $post['body'],
            'id_category'  => $post['id_category'],
        ];
        $model = model(NewsModel::class);
        $model->save($data);
---
UPDATE `news` SET `title` = 'Adahi Morillo', `slug` = 'adahi-morillo', `body` = 'ljkiojogirjeignregreg'
WHERE `news`.`id` IN ('11')